import { Tool } from 'fastmcp';
import z from 'zod';

const name = '电商产品海报提示词助手';
const description = '包含推荐的电商产品商海报提示词';

export const productPosterHelper: Tool<any, any> = {
  name,
  description,
  parameters: z.object({}),
  execute: async (_args, _context) => {
    return `推荐提示词：

1. 商业级产品摄影作品,杰作,质量最好,这是一张笔记本电脑的高分辨率照片,笔记本屏幕显示开机画面场景,笔记本电脑放置在水上的黑色岩石,超大行星背景,宇宙空间,科幻,低视角,产品摄影,现实

2. 商业级质感的居家场景，深棕色木质圆形餐桌（木纹细腻、温润有质感），桌上放置一台银色便携式照片打印机（机身带精致竖条纹理，金属质感细腻且充满科技感），打印机正打印一张色彩绚丽的风景照；周围散落三张打印好的照片，分别呈现盛放的花卉、精致的美食、手捧的花束（照片色彩饱满、画质清晰、细节生动）；画面右上角点缀几朵明黄色鲜花，增添生机。整体光线柔和温暖，光影层次分明，营造出温馨且高级的氛围，全画面细节精致，凸显产品的高品质商业展示感

3. 商业级奢侈品香水摄影，方形深琥珀色香水瓶（瓶身通透莹润，内部液体浓郁且折射暖光，瓶身印 “LOUIS MARCO Deep Woody” 清晰字样），顶部配纹理细腻、质感温润的木质瓶盖；香水瓶置于深棕色菱格纹皮革表面（皮革柔软有光泽、纹理精致）；背景为暖棕到深棕的渐变色调，一束柔和暖黄色光线精准照射，在瓶身营造通透光泽感，细腻勾勒木质瓶盖纹理，让皮革表面形成柔和明暗过渡；整体氛围奢华温暖，光影层次分明，细节极致精致，凸显高端商业产品质感，8K 高清画质。`;
  },
};
